import "./AboutUs.css";

const AboutUs = () => {
  return (
    <section className="about-us">
      <div className="about_container">
        <div>
          <h1 className="title">আমাদের সম্পর্কে</h1>
        </div>
        <div>
          <p className="description">
            ইশাস-এ স্বাগতম, আমাদের সংগঠন যা মানব কল্যাণে নিবেদিত। আমরা দরিদ্রদের
            সাহায্য করতে, রক্তদান অভিযান সংগঠিত করতে, ধর্মীয় অনুষ্ঠান আয়োজন
            করতে এবং বিভিন্ন ক্রীড়া, সাংস্কৃতিক এবং উন্নয়নমূলক কার্যক্রম
            পরিচালনা করতে প্রতিশ্রুতিবদ্ধ। আমাদের লক্ষ্য হল আমাদের সম্প্রদায়
            এবং তার বাইরেও একটি ইতিবাচক প্রভাব তৈরি করা।
          </p>
        </div>
        <div className="cards">
          <div className="card">
            <h2>আমাদের মিশন</h2>
            <p>
              দরিদ্রদের সমর্থন এবং সহায়তা প্রদান করা, সম্প্রদায়ের মনোবল বৃদ্ধি
              করা, এবং বিভিন্ন কার্যক্রম ও প্রোগ্রামের মাধ্যমে সামগ্রিক মঙ্গল
              প্রচার করা।
            </p>
          </div>
          <div className="card">
            <h2>আমাদের লক্ষ্য</h2>
            <p>
              একটি সহানুভূতিশীল এবং অন্তর্ভুক্তিমূলক সমাজ গঠন করা যেখানে
              প্রত্যেকে সম্প্রদায়ের বৃদ্ধিতে সহায়তা করার এবং সমৃদ্ধির সুযোগ
              পায়।
            </p>
          </div>
          <div className="card">
            <h2>আমাদের মূল্যবোধ</h2>
            <p>সহানুভূতি, সততা, অন্তর্ভুক্তি, সহযোগিতা, এবং প্রতিশ্রুতি।</p>
          </div>
        </div>
      </div>
    </section>
  );
};

export default AboutUs;
